### Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd

data = {'Name': ['John', 'Jane', 'Mike', 'Emily'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'London', 'Paris', 'Tokyo']}

df = pd.DataFrame(data)

In [3]:
df.head()

    Name  Age      City
0   John   25  New York
1   Jane   30    London
2   Mike   35     Paris
3  Emily   28     Tokyo

In [4]:
df.tail()

    Name  Age      City
0   John   25  New York
1   Jane   30    London
2   Mike   35     Paris
3  Emily   28     Tokyo

In [5]:
df.describe()

             Age
count   4.000000
mean   29.500000
std     4.203173
min    25.000000
25%    27.250000
50%    29.000000
75%    31.250000
max    35.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [7]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
data = {'A': [10, 20, 30, 40],
        'B': [50, 60, 70, 80],
        'C': [90, 100, 110, 120]}

df = pd.DataFrame(data)

In [14]:
df.index = pd.RangeIndex(start = 1, stop = len(df) * 2, step = 2)
df

    A   B    C
1  10  50   90
3  20  60  100
5  30  70  110
7  40  80  120

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [15]:
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)

In [18]:
print("Sum of the first three values :", df['Values'].head(3).sum())

Sum of the first three values : 60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [19]:
data = {'Text': ['This is a sample text', 'Hello world', 'Python programming is fun']}
df = pd.DataFrame(data)

In [20]:
df['Word_Count'] = df['Text'].apply(lambda x : len(x.split()))
df.head()

                        Text  Word_Count
0      This is a sample text           5
1                Hello world           2
2  Python programming is fun           4

### Q5. How are DataFrame.size() and DataFrame.shape() different?

    DataFrame.shape: This attribute returns a tuple representing the dimensions of the DataFrame. It provides two values: the number of rows and the number of columns in the DataFrame.
    
    DataFrame.size: This attribute returns the total number of elements in the DataFrame. It is calculated as the product of the number of rows (DataFrame.shape[0]) and the number of columns (DataFrame.shape[1]).

### Q6. Which function of pandas do we use to read an excel file?

    To read an Excel file in pandas, you can use the read_excel() function. This function is specifically designed to read data from Excel files into a pandas DataFrame.

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [21]:
data = {'Email': ['john.doe@example.com', 'jane.smith@example.com', 'mike@example.com']}
df = pd.DataFrame(data)

In [24]:
df['Username'] = df['Email'].apply(lambda x : x.split('@')[0])

In [25]:
df.head()

                    Email    Username
0    john.doe@example.com    john.doe
1  jane.smith@example.com  jane.smith
2        mike@example.com        mike

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [26]:
data = {'A': [3, 8, 4, 7, 9],
        'B': [5, 2, 6, 3, 8],
        'C': [1, 6, 2, 9, 4]}
df = pd.DataFrame(data)

In [27]:
def select_rows(df):
    return df[(df['A'] > 5) & (df['B'] < 10)]

select_rows(df)

   A  B  C
1  8  2  6
3  7  3  9
4  9  8  4

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [28]:
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)

In [29]:
def calculate_statistics(df):
    values_column = df['Values']
    mean_value = values_column.mean()
    median_value = values_column.median()
    std_value = values_column.std()
    return mean_value, median_value, std_value

mean, median, std = calculate_statistics(df)
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [30]:
data = {'Sales': [10, 20, 15, 30, 25, 35, 40, 50, 45, 55],
        'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10']}
df = pd.DataFrame(data)

In [34]:
def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window = 7).mean()
    return df

df['Date'] = pd.to_datetime(df['Date'])

df_with_moving_average = calculate_moving_average(df)
df_with_moving_average

   Sales       Date  MovingAverage
0     10 2023-01-01            NaN
1     20 2023-01-02            NaN
2     15 2023-01-03            NaN
3     30 2023-01-04            NaN
4     25 2023-01-05            NaN
5     35 2023-01-06            NaN
6     40 2023-01-07      25.000000
7     50 2023-01-08      30.714286
8     45 2023-01-09      34.285714
9     55 2023-01-10      40.000000

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [35]:
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03']}
df = pd.DataFrame(data)

In [39]:
df['Date'] = pd.to_datetime(df['Date'])
df['Weekday'] = df['Date'].dt.day_name()
df

        Date  Weekday
0 2023-01-01   Sunday
1 2023-01-02   Monday
2 2023-01-03  Tuesday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [41]:
data = {'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-10']}
df = pd.DataFrame(data)

In [45]:
df['Date'] = pd.to_datetime(df['Date'])
df[df['Date'].between(pd.to_datetime('2023-01-01'), pd.to_datetime('2023-01-31'))]

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-31

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [46]:
import pandas as pd